// 用語a , 用語b
var arr = [
	['服務器','伺服器'],
    ['插件','擴充元件'],
    ['調試','除錯'],
    ['編程','程式設計'],
    ['集成','整合'],
    ['有效負載',' payload '],
    ['有效荷載',' payload '],
    ['流','串流'],
    ['單擊','點擊'],
    ['拓展','擴充'],
    ['信息','資訊'],
    ['滑動條','滑桿'],
    ['設置','設定'],
    ['配置','設定'],
    ['菜單','選單'],
    ['通信','通訊'],
    ['交互','互動'],
    ['用戶','使用者'],
    ['軟件','軟體'],
    ['硬件','硬體'],
    ['固件','韌體'],
    ['設備','裝置'],
    ['字節','位元組'],
    ['閃','燒錄'],
    ['卸載','解除安裝'],
    ['加載','載入'],
    ['源代碼','原始碼'],
    ['高級','進階'],
    ['端口','埠'],
    ['開放原始碼','開源'],
    ['創建','建立'],
    ['支持','支援'],
    ['訪問','存取'],
    ['憑據','憑證'],
    ['計算機','電腦'],
    ['消息','訊息'],
    ['運行','執行'],
    ['添加','加入'],
    ['IP地址','IP位址'],
    ['變量','變數'],
    ['實時','即時'],
    ['設定文件','設定檔'],
    ['發送','傳送'],
    ['標識符','ID'],
    ['示例','範例'],
    ['斷開連接','中斷連線'],
    ['帶寬','頻寬'],
    ['導入','匯入'],
    ['用例','應用案例'],
    ['優化','最佳化'],
    ['實例','實體'],
    ['對象','物件']
]
function rpstr(stra,strb){
var reg = RegExp(stra,'g');
//console.log(reg);  //Debug
for(let fnt of textL) {
    fnt.innerHTML = fnt.innerHTML.replace(reg,strb)
}
}

var textL = document.getElementsByTagName('font');
arr.forEach(function(e){
    rpstr(e[0],e[1])
})